app/controllers/requests_controller.rb

  def index
    if current_user.admin == true
      @requests = Request.all
---
SELECT * FROM "requests" WHERE ("requests".user_id = 1) LIMIT 1

  def show
    @request = Request.find(params[:id])
---
SELECT * FROM "requests" WHERE ("requests"."id" = 0)

  def create
    @request = Request.new(params[:request])
    @request.user_id = current_user.id
    if @request.save
---
INSERT INTO "requests" ("total", "leavedate", "updated_at", "photo_file_size", "returndate", "photo_file_name", "created_at", "authorised", "photo_content_type", "user_id", "photo_updated_at") VALUES(1, '2012-04-13', '2012-04-13 12:59:26', 53657, '2012-04-13', 'omg-it-spins.jpg', '2012-04-13 12:59:26', NULL, 'image/jpeg', 49, '2012-04-13 12:59:26')

  def edit
    @request = Request.find(params[:id])
---
SELECT * FROM "requests" WHERE ("requests"."id" = 1)

  def update
    @request = Request.find(params[:id])
    if @request.update_attributes(params[:request])
---
SELECT * FROM "requests" WHERE ("requests"."id" = 1)
UPDATE "requests" SET "updated_at" = '2012-04-13 12:59:37', "photo_file_size" = 53657, "photo_content_type" = 'image/jpeg', "photo_file_name" = 'omg-it-spins.jpg', "photo_updated_at" = '2012-04-13 12:59:37' WHERE "id" = 1

  def destroy
    @request = Request.find(params[:id])
    @request.destroy
---
SELECT * FROM "requests" WHERE ("requests"."id" = 1)
DELETE FROM "requests" WHERE "id" = 1