app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "admin", "password_salt", "password_hash", "email") VALUES('2012-01-27 13:35:27', '2012-01-27 13:35:27', 'jpfinlay', NULL, '751aa946f10ad4683d34815535b2d46725db639b', 'bf383ea5e02eff24e2c8d1fa12556a6bc8ffa7d2', 'jpfinlay@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save